src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Банк</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРКО</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидыОперацийРКО/ВидыОперацийРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочийРасход</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходСчетМиша</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Объект.ВидОперации	= Перечисления.ВидыОперацийРКО.ПрочийРасход;
		Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие расходы");
		Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
		Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВлючатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк);
	а2 = Объект.Статья.НеВключатьВРасходы;
	
	Объект.НеВключатьВРасходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Счет.Видимость			= (Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк);

КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииСервер()
	
	Объект.Валюта = Объект.Касса.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();

	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры
